
## Plan Result (push-server-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/42112)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 31 to add, 0 to change, 22 to destroy.</code></pre>

* Create
  * aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511
  * aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2
  * aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99
  * aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED
  * aws_cloudwatch_log_group.app-log-group
  * aws_cloudwatch_log_group.aws-otel-collector-log-group
  * aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1
  * aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0
  * aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7
  * aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0
  * aws_ecs_cluster.application_ecs_cluster_4DC6EFB3
  * aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6
  * aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA
  * aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED
  * aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355
  * aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E
  * aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF
  * aws_security_group.application_ecs_service_ecs_security_group_231C6B1E
  * aws_sns_topic.pagerduty_alarm-critical-topic_F1534579
  * aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3
  * aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84
  * aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B
  * pagerduty_service.pagerduty_pagerduty-critical_464EE7CD
  * pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938
  * pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5
  * pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C
  * pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23
  * pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197
* Delete
  * aws_appautoscaling_policy.service_scale_in_policy
  * aws_appautoscaling_policy.service_scale_out_policy
  * aws_appautoscaling_target.service_autoscaling_target
  * aws_cloudwatch_log_group.config
  * aws_cloudwatch_log_group.push
  * aws_cloudwatch_metric_alarm.service_scale_in_alarm
  * aws_cloudwatch_metric_alarm.service_scale_out_alarm
  * aws_ecs_cluster.ecs-cluster
  * aws_ecs_service.push
  * aws_ecs_task_definition.push
  * aws_security_group.ecs_security_group
  * aws_sns_topic.alarm_critical
  * aws_sns_topic.alarm_non_critical
  * aws_sns_topic_subscription.infrastructure_alarm_critical
  * aws_sns_topic_subscription.infrastructure_alarm_non_critical
  * null_resource.update-service
  * pagerduty_service.critical
  * pagerduty_service.non_critical
  * pagerduty_service_integration.cloudwatch_critical
  * pagerduty_service_integration.cloudwatch_non_critical
  * pagerduty_service_integration.sentry
  * random_id.service_name


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511 will be created
  + resource "aws_appautoscaling_policy" "application_autoscaling_scale_in_policy_BF273511" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "Push-Prod-ScaleInPolicy"
      + policy_type        = "StepScaling"
      + resource_id        = "service/Push-Prod/Push-Prod"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_upper_bound = "0"
              + scaling_adjustment          = -1
            }
        }
    }

  # aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2 will be created
  + resource "aws_appautoscaling_policy" "application_autoscaling_scale_out_policy_D03900A2" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "Push-Prod-ScaleOutPolicy"
      + policy_type        = "StepScaling"
      + resource_id        = "service/Push-Prod/Push-Prod"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = 2
            }
        }
    }

  # aws_appautoscaling_policy.service_scale_in_policy will be destroyed
  # (because aws_appautoscaling_policy.service_scale_in_policy is not in configuration)
  - resource "aws_appautoscaling_policy" "service_scale_in_policy" {
      - alarm_arns         = [
          - "arn:aws:cloudwatch:us-east-1:996905175585:alarm:Push Service Queue Size Reduced",
        ] -> null
      - arn                = "arn:aws:autoscaling:us-east-1:996905175585:scalingPolicy:4a2191f2-6ef9-453f-b4fe-48ba8917abc7:resource/ecs/service/Push-Prod/PushNotifications6912ccdb32711a4b:policyName/ScaleInPolicy" -> null
      - id                 = "ScaleInPolicy" -> null
      - name               = "ScaleInPolicy" -> null
      - policy_type        = "StepScaling" -> null
      - resource_id        = "service/Push-Prod/PushNotifications6912ccdb32711a4b" -> null
      - scalable_dimension = "ecs:service:DesiredCount" -> null
      - service_namespace  = "ecs" -> null

      - step_scaling_policy_configuration {
          - adjustment_type          = "ChangeInCapacity" -> null
          - cooldown                 = 60 -> null
          - metric_aggregation_type  = "Average" -> null
          - min_adjustment_magnitude = 0 -> null

          - step_adjustment {
              - metric_interval_upper_bound = "0" -> null
              - scaling_adjustment          = -1 -> null
            }
        }
    }

  # aws_appautoscaling_policy.service_scale_out_policy will be destroyed
  # (because aws_appautoscaling_policy.service_scale_out_policy is not in configuration)
  - resource "aws_appautoscaling_policy" "service_scale_out_policy" {
      - alarm_arns         = [
          - "arn:aws:cloudwatch:us-east-1:996905175585:alarm:Push Service Queue Size Exceeded",
        ] -> null
      - arn                = "arn:aws:autoscaling:us-east-1:996905175585:scalingPolicy:4a2191f2-6ef9-453f-b4fe-48ba8917abc7:resource/ecs/service/Push-Prod/PushNotifications6912ccdb32711a4b:policyName/ScaleOutPolicy" -> null
      - id                 = "ScaleOutPolicy" -> null
      - name               = "ScaleOutPolicy" -> null
      - policy_type        = "StepScaling" -> null
      - resource_id        = "service/Push-Prod/PushNotifications6912ccdb32711a4b" -> null
      - scalable_dimension = "ecs:service:DesiredCount" -> null
      - service_namespace  = "ecs" -> null

      - step_scaling_policy_configuration {
          - adjustment_type          = "ChangeInCapacity" -> null
          - cooldown                 = 600 -> null
          - metric_aggregation_type  = "Average" -> null
          - min_adjustment_magnitude = 0 -> null

          - step_adjustment {
              - metric_interval_lower_bound = "0" -> null
              - scaling_adjustment          = 2 -> null
            }
        }
    }

  # aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99 will be created
  + resource "aws_appautoscaling_target" "application_autoscaling_autoscaling_target_42BF5C99" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 2
      + resource_id        = "service/Push-Prod/Push-Prod"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = (known after apply)
    }

  # aws_appautoscaling_target.service_autoscaling_target will be destroyed
  # (because aws_appautoscaling_target.service_autoscaling_target is not in configuration)
  - resource "aws_appautoscaling_target" "service_autoscaling_target" {
      - arn                = "arn:aws:application-autoscaling:us-east-1:996905175585:scalable-target/0ec54a2191f26ef9453fb4fe48ba8917abc7" -> null
      - id                 = "service/Push-Prod/PushNotifications6912ccdb32711a4b" -> null
      - max_capacity       = 10 -> null
      - min_capacity       = 1 -> null
      - resource_id        = "service/Push-Prod/PushNotifications6912ccdb32711a4b" -> null
      - role_arn           = "arn:aws:iam::996905175585:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> null
      - scalable_dimension = "ecs:service:DesiredCount" -> null
      - service_namespace  = "ecs" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED will be created
  + resource "aws_cloudwatch_dashboard" "application_cloudwatch-dashboard_1F3DC0ED" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = jsonencode(
            {
              + widgets = [
                  + {
                      + height     = 6
                      + properties = {
                          + annotations = {
                              + horizontal = [
                                  + {
                                      + color = "#e377c2"
                                      + label = "CPU scale out"
                                      + value = 45
                                    },
                                  + {
                                      + color = "#c5b0d5"
                                      + label = "CPU scale in"
                                      + value = 30
                                    },
                                ]
                            }
                          + metrics     = [
                              + [
                                  + "ECS/ContainerInsights",
                                  + "RunningTaskCount",
                                  + "ServiceName",
                                  + "Push-Prod",
                                  + "ClusterName",
                                  + "Push-Prod",
                                  + {
                                      + color = "#c49c94"
                                      + yAxis = "right"
                                    },
                                ],
                              + [
                                  + "AWS/ECS",
                                  + "CPUUtilization",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + color = "#f7b6d2"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "MemoryUtilization",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + color = "#c7c7c7"
                                    },
                                ],
                            ]
                          + period      = 60
                          + region      = "us-east-1"
                          + stacked     = false
                          + stat        = "Average"
                          + title       = "Service Load"
                          + view        = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 0
                      + y          = 6
                    },
                ]
            }
        )
      + dashboard_name = "Push-Prod"
      + id             = (known after apply)
    }

  # aws_cloudwatch_log_group.app-log-group will be created
  + resource "aws_cloudwatch_log_group" "app-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/Backend/Push-Prod/ecs/app"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = true
      + tags              = {
          + "environment" = "Prod"
          + "service"     = "Push"
        }
      + tags_all          = {
          + "environment" = "Prod"
          + "service"     = "Push"
        }
    }

  # aws_cloudwatch_log_group.aws-otel-collector-log-group will be created
  + resource "aws_cloudwatch_log_group" "aws-otel-collector-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/Backend/Push-Prod/ecs/aws-otel-collector"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = true
      + tags              = {
          + "environment" = "Prod"
          + "service"     = "Push"
        }
      + tags_all          = {
          + "environment" = "Prod"
          + "service"     = "Push"
        }
    }

  # aws_cloudwatch_log_group.config will be destroyed
  # (because aws_cloudwatch_log_group.config is not in configuration)
  - resource "aws_cloudwatch_log_group" "config" {
      - arn               = "arn:aws:logs:us-east-1:996905175585:log-group:/ecs/Push/Prod/config" -> null
      - id                = "/ecs/Push/Prod/config" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/ecs/Push/Prod/config" -> null
      - retention_in_days = 30 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "environment" = "Prod"
          - "service"     = "Push"
        } -> null
      - tags_all          = {
          - "environment" = "Prod"
          - "service"     = "Push"
        } -> null
    }

  # aws_cloudwatch_log_group.push will be destroyed
  # (because aws_cloudwatch_log_group.push is not in configuration)
  - resource "aws_cloudwatch_log_group" "push" {
      - arn               = "arn:aws:logs:us-east-1:996905175585:log-group:/ecs/Push/Prod/push" -> null
      - id                = "/ecs/Push/Prod/push" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/ecs/Push/Prod/push" -> null
      - retention_in_days = 30 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "environment" = "Prod"
          - "service"     = "Push"
        } -> null
      - tags_all          = {
          - "environment" = "Prod"
          - "service"     = "Push"
        } -> null
    }

  # aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1 will be created
  + resource "aws_cloudwatch_metric_alarm" "application_autoscaling_scale_in_alarm_850BE3A1" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm to reduce capacity if container CPU is low"
      + alarm_name                            = "Push-Prod Service Low CPU"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "Push-Prod"
          + "ServiceName" = "Push-Prod"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 60
      + statistic                             = "Average"
      + tags                                  = {
          + "environment" = "Prod"
          + "service"     = "Push"
        }
      + tags_all                              = {
          + "environment" = "Prod"
          + "service"     = "Push"
        }
      + threshold                             = 30
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0 will be created
  + resource "aws_cloudwatch_metric_alarm" "application_autoscaling_scale_out_alarm_E40FCBA0" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm to add capacity if container CPU is high"
      + alarm_name                            = "Push-Prod Service High CPU"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "Push-Prod"
          + "ServiceName" = "Push-Prod"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 60
      + statistic                             = "Average"
      + tags                                  = {
          + "environment" = "Prod"
          + "service"     = "Push"
        }
      + tags_all                              = {
          + "environment" = "Prod"
          + "service"     = "Push"
        }
      + threshold                             = 45
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.service_scale_in_alarm will be destroyed
  # (because aws_cloudwatch_metric_alarm.service_scale_in_alarm is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "service_scale_in_alarm" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:autoscaling:us-east-1:996905175585:scalingPolicy:4a2191f2-6ef9-453f-b4fe-48ba8917abc7:resource/ecs/service/Push-Prod/PushNotifications6912ccdb32711a4b:policyName/ScaleInPolicy",
        ] -> null
      - alarm_description         = "Only a few messages are in the queue" -> null
      - alarm_name                = "Push Service Queue Size Reduced" -> null
      - arn                       = "arn:aws:cloudwatch:us-east-1:996905175585:alarm:Push Service Queue Size Reduced" -> null
      - comparison_operator       = "LessThanThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {
          - "QueueName" = "pocket-push-queue"
        } -> null
      - evaluation_periods        = 2 -> null
      - id                        = "Push Service Queue Size Reduced" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "ApproximateNumberOfMessagesVisible" -> null
      - namespace                 = "AWS/SQS" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 100 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # aws_cloudwatch_metric_alarm.service_scale_out_alarm will be destroyed
  # (because aws_cloudwatch_metric_alarm.service_scale_out_alarm is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "service_scale_out_alarm" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:autoscaling:us-east-1:996905175585:scalingPolicy:4a2191f2-6ef9-453f-b4fe-48ba8917abc7:resource/ecs/service/Push-Prod/PushNotifications6912ccdb32711a4b:policyName/ScaleOutPolicy",
        ] -> null
      - alarm_description         = "Too many messages pending in the queue" -> null
      - alarm_name                = "Push Service Queue Size Exceeded" -> null
      - arn                       = "arn:aws:cloudwatch:us-east-1:996905175585:alarm:Push Service Queue Size Exceeded" -> null
      - comparison_operator       = "GreaterThanThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {
          - "QueueName" = "pocket-push-queue"
        } -> null
      - evaluation_periods        = 2 -> null
      - id                        = "Push Service Queue Size Exceeded" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "ApproximateNumberOfMessagesVisible" -> null
      - namespace                 = "AWS/SQS" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 1000 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7 will be created
  + resource "aws_ecr_lifecycle_policy" "application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "expire old images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 800
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "push-prod-app"
    }

  # aws_ecr_repository.application_ecs_se

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

                    }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:996905175585:Push-Prod-InfrastructureAlarmCritical"
                      - Sid       = "__default_statement_ID"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - signature_version                        = 0 -> null
      - sqs_success_feedback_sample_rate         = 0 -> null
      - tags                                     = {
          - "environment" = "Prod"
          - "service"     = "Push"
        } -> null
      - tags_all                                 = {
          - "environment" = "Prod"
          - "service"     = "Push"
        } -> null
    }

  # aws_sns_topic.alarm_non_critical will be destroyed
  # (because aws_sns_topic.alarm_non_critical is not in configuration)
  - resource "aws_sns_topic" "alarm_non_critical" {
      - application_success_feedback_sample_rate = 0 -> null
      - arn                                      = "arn:aws:sns:us-east-1:996905175585:Push-Prod-InfrastructureAlarmNonCritical" -> null
      - content_based_deduplication              = false -> null
      - fifo_topic                               = false -> null
      - firehose_success_feedback_sample_rate    = 0 -> null
      - http_success_feedback_sample_rate        = 0 -> null
      - id                                       = "arn:aws:sns:us-east-1:996905175585:Push-Prod-InfrastructureAlarmNonCritical" -> null
      - lambda_success_feedback_sample_rate      = 0 -> null
      - name                                     = "Push-Prod-InfrastructureAlarmNonCritical" -> null
      - owner                                    = "996905175585" -> null
      - policy                                   = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                          - "SNS:Receive",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceOwner" = "996905175585"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:996905175585:Push-Prod-InfrastructureAlarmNonCritical"
                      - Sid       = "__default_statement_ID"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - signature_version                        = 0 -> null
      - sqs_success_feedback_sample_rate         = 0 -> null
      - tags                                     = {
          - "environment" = "Prod"
          - "service"     = "Push"
        } -> null
      - tags_all                                 = {
          - "environment" = "Prod"
          - "service"     = "Push"
        } -> null
    }

  # aws_sns_topic.pagerduty_alarm-critical-topic_F1534579 will be created
  + resource "aws_sns_topic" "pagerduty_alarm-critical-topic_F1534579" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "Push-Prod-Infrastructure-Alarm-Critical"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3 will be created
  + resource "aws_sns_topic" "pagerduty_alarm-non-critical-topic_53C1A3B3" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "Push-Prod-Infrastructure-Alarm-Non-Critical"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_subscription.infrastructure_alarm_critical will be destroyed
  # (because aws_sns_topic_subscription.infrastructure_alarm_critical is not in configuration)
  - resource "aws_sns_topic_subscription" "infrastructure_alarm_critical" {
      - arn                             = "arn:aws:sns:us-east-1:996905175585:Push-Prod-InfrastructureAlarmCritical:0482da6d-2829-441b-907e-470f919546d1" -> null
      - confirmation_timeout_in_minutes = 2 -> null
      - confirmation_was_authenticated  = false -> null
      - endpoint                        = "https://events.pagerduty.com/integration/b66d9a0bd9424600d0e71920177f82f5/enqueue" -> null
      - endpoint_auto_confirms          = true -> null
      - id                              = "arn:aws:sns:us-east-1:996905175585:Push-Prod-InfrastructureAlarmCritical:0482da6d-2829-441b-907e-470f919546d1" -> null
      - owner_id                        = "996905175585" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "https" -> null
      - raw_message_delivery            = false -> null
      - topic_arn                       = "arn:aws:sns:us-east-1:996905175585:Push-Prod-InfrastructureAlarmCritical" -> null
    }

  # aws_sns_topic_subscription.infrastructure_alarm_non_critical will be destroyed
  # (because aws_sns_topic_subscription.infrastructure_alarm_non_critical is not in configuration)
  - resource "aws_sns_topic_subscription" "infrastructure_alarm_non_critical" {
      - arn                             = "arn:aws:sns:us-east-1:996905175585:Push-Prod-InfrastructureAlarmNonCritical:a310d8a5-7daf-45bc-aec1-9ce9ec584b9b" -> null
      - confirmation_timeout_in_minutes = 2 -> null
      - confirmation_was_authenticated  = false -> null
      - endpoint                        = "https://events.pagerduty.com/integration/081e53c68ee24201c0274f189a32b7dc/enqueue" -> null
      - endpoint_auto_confirms          = true -> null
      - id                              = "arn:aws:sns:us-east-1:996905175585:Push-Prod-InfrastructureAlarmNonCritical:a310d8a5-7daf-45bc-aec1-9ce9ec584b9b" -> null
      - owner_id                        = "996905175585" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "https" -> null
      - raw_message_delivery            = false -> null
      - topic_arn                       = "arn:aws:sns:us-east-1:996905175585:Push-Prod-InfrastructureAlarmNonCritical" -> null
    }

  # aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84 will be created
  + resource "aws_sns_topic_subscription" "pagerduty_alarm-critical-subscription_E2168B84" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 2
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = true
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B will be created
  + resource "aws_sns_topic_subscription" "pagerduty_alarm-non-critical-subscription_4702677B" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 2
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = true
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # null_resource.update-service will be destroyed
  # (because null_resource.update-service is not in configuration)
  - resource "null_resource" "update-service" {
      - id       = "671702548441364657" -> null
      - triggers = {
          - "arn" = "arn:aws:ecs:us-east-1:996905175585:service/Push-Prod/PushNotifications6912ccdb32711a4b"
        } -> null
    }

  # pagerduty_service.critical will be destroyed
  # (because pagerduty_service.critical is not in configuration)
  - resource "pagerduty_service" "critical" {
      - acknowledgement_timeout = "600" -> null
      - alert_creation          = "create_incidents" -> null
      - alert_grouping_timeout  = "null" -> null
      - auto_resolve_timeout    = "14400" -> null
      - created_at              = "2023-08-18T07:58:11-07:00" -> null
      - description             = "Managed by Terraform" -> null
      - escalation_policy       = "PQ2EUPZ" -> null
      - html_url                = "https://mozilla.pagerduty.com/service-directory/PBS7YII" -> null
      - id                      = "PBS7YII" -> null
      - name                    = "Push-Prod-Critical" -> null
      - status                  = "active" -> null
      - type                    = "service" -> null

      - alert_grouping_parameters {
        }

      - incident_urgency_rule {
          - type    = "constant" -> null
          - urgency = "high" -> null
        }
    }

  # pagerduty_service.non_critical will be destroyed
  # (because pagerduty_service.non_critical is not in configuration)
  - resource "pagerduty_service" "non_critical" {
      - acknowledgement_timeout = "600" -> null
      - alert_creation          = "create_incidents" -> null
      - alert_grouping_timeout  = "null" -> null
      - auto_resolve_timeout    = "14400" -> null
      - created_at              = "2023-08-18T07:58:11-07:00" -> null
      - description             = "Managed by Terraform" -> null
      - escalation_policy       = "PXOQVEP" -> null
      - html_url                = "https://mozilla.pagerduty.com/service-directory/PF1VZY8" -> null
      - id                      = "PF1VZY8" -> null
      - name                    = "Push-Prod-Non-Critical" -> null
      - status                  = "active" -> null
      - type                    = "service" -> null

      - alert_grouping_parameters {
        }

      - incident_urgency_rule {
          - type    = "constant" -> null
          - urgency = "low" -> null
        }
    }

  # pagerduty_service.pagerduty_pagerduty-critical_464EE7CD will be created
  + resource "pagerduty_service" "pagerduty_pagerduty-critical_464EE7CD" {
      + acknowledgement_timeout = "1800"
      + alert_creation          = "create_incidents"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "14400"
      + created_at              = (known after apply)
      + description             = "PagerDuty Critical"
      + escalation_policy       = "PXOQVEP"
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "Push-Prod-PagerDuty-Critical"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + incident_urgency_rule {
          + type    = "constant"
          + urgency = "high"
        }
    }

  # pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938 will be created
  + resource "pagerduty_service" "pagerduty_pagerduty-non-critical_B4CB3938" {
      + acknowledgement_timeout = "1800"
      + alert_creation          = "create_incidents"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "14400"
      + created_at              = (known after apply)
      + description             = "PagerDuty Non-Critical"
      + escalation_policy       = "PXOQVEP"
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "Push-Prod-PagerDuty-Non-Critical"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + incident_urgency_rule {
          + type    = "constant"
          + urgency = "low"
        }
    }

  # pagerduty_service_integration.cloudwatch_critical will be destroyed
  # (because pagerduty_service_integration.cloudwatch_critical is not in configuration)
  - resource "pagerduty_service_integration" "cloudwatch_critical" {
      - html_url        = "https://mozilla.pagerduty.com/services/PBS7YII/integrations/PH4A9UJ" -> null
      - id              = "PH4A9UJ" -> null
      - integration_key = "b66d9a0bd9424600d0e71920177f82f5" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "PBS7YII" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.cloudwatch_non_critical will be destroyed
  # (because pagerduty_service_integration.cloudwatch_non_critical is not in configuration)
  - resource "pagerduty_service_integration" "cloudwatch_non_critical" {
      - html_url        = "https://mozilla.pagerduty.com/services/PF1VZY8/integrations/P1HC9K2" -> null
      - id              = "P1HC9K2" -> null
      - integration_key = "081e53c68ee24201c0274f189a32b7dc" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "PF1VZY8" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

  # pagerduty_service_integration.sentry will be destroyed
  # (because pagerduty_service_integration.sentry is not in configuration)
  - resource "pagerduty_service_integration" "sentry" {
      - html_url        = "https://mozilla.pagerduty.com/services/PF1VZY8/integrations/PKDLN79" -> null
      - id              = "PKDLN79" -> null
      - integration_key = "7e359dd8c3c44306d03ce98dc49177a2" -> null
      - name            = "Sentry" -> null
      - service         = "PF1VZY8" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

  # random_id.service_name will be destroyed
  # (because random_id.service_name is not in configuration)
  - resource "random_id" "service_name" {
      - b64_std     = "PushNotificationsaRLM2zJxGks=" -> null
      - b64_url     = "PushNotificationsaRLM2zJxGks" -> null
      - byte_length = 8 -> null
      - dec         = "PushNotifications7571339165379402315" -> null
      - hex         = "PushNotifications6912ccdb32711a4b" -> null
      - id          = "aRLM2zJxGks" -> null
      - keepers     = {
          - "version" = "v3"
        } -> null
      - prefix      = "PushNotifications" -> null
    }

Plan: 31 to add, 0 to change, 22 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"b72ff590-0263-48ae-a898-beb03bd73979","JobName":"push-server_infrastructure_plan_prod","PRNumber":157,"Program":"tfcmt","SHA1":"804f9a8b9c7c4a3592f3527304134a2c74140e39","Target":"push-server-cdk","Vars":{}} -->